//Homework №5

/* Using ONLY material given by last 3 lessons of course */

let todayYear = 2023;
let giveYear = prompt(`Task:
Запросити у користувача рік народження.
Запитати в нього, в якому місті він живе.
Запитати його улюблений вид спорту.

При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

Його вік. Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач запровадить один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.

Все це має бути відображено в одному вікні (алерті).

Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення - "Шкода, що Ви не захотіли ввести свій(ю) ..." і вказуємо, що він не захотів вводити - дату народження, місто або вид спорту.

Вкажіть дату Вашого народження:`);

let giveCity = prompt('Вкажіть місто, в якому Ви живете:');
let giveFavSport = prompt('Вкажіть Ваш улюблений вид спорту:');

switch (true) {
   case giveYear === null:
      giveYear = 'Шкода, що Ви не захотіли ввести дату народження...';
      break;
   case giveYear === '':
      giveYear = 'Ви нічого не ввели..';
      break;
   case Number.isNaN(Number(giveYear)):
      giveYear = 'Ви ввели не число.';
      break;
   case Number(giveYear) % 1 !== 0:
      giveYear = 'Ви вказали не ціле число.';
      break;
   case Number(giveYear) < 1900: 
      giveYear = 'Щось Вам забагато років :)';
      break;
   case Number(giveYear) > 2023:
      giveYear = 'Ви з майбутнього?';
      break;
   case Number(giveYear) === 2023:
      giveYear = 'Відповідає мати чи батько?)';
      break;
   default:
      giveYear = `Вам ${todayYear - Number(giveYear)} років.`;
}

switch (giveCity) {
   case null: 
      giveCity = 'Шкода, що Ви не захотіли ввести своє місто...';
      break;
   case '':
      giveCity = 'Ви знову нічого не ввели..';
   break;
   case 'Лондон':
      giveCity = 'Ти живеш у столиці Великої Британії.';
      break;
   case 'Вашингтон':
      giveCity = 'Ти живеш у столиці США.';
      break;
   case 'Київ':
      giveCity = 'Ти живеш у столиці України.';
      break;
   default:
      giveCity = `Ти живеш у місті ${giveCity}.`;
   }

switch (giveFavSport) {
   case null: 
      giveFavSport = 'Шкода, що Ви не захотіли ввести Ваш улюблений вид спорту...';
      break;
   case '': 
      giveFavSport = 'Ви взагалі нічого не ввели..';
   break;
   case 'Баскетбол':
      giveFavSport = 'Круто! Хочеш стати Майклом Джорданом?';
      break;
   case 'Бокс':
      giveFavSport = 'Круто! Хочеш стати Майком Тайсоном?';
      break;
   case 'Футбол':
      giveFavSport = 'Круто! Хочеш стати Ліонелем Мессі?';
      break;
   default:
      `Твій улюблений вид спорту - ${giveFavSport}.`
}

alert(`${giveYear}
${giveCity}
${giveFavSport}`);